     A*=========================================================
     A* ORDENTRYD - 受注入力画面 DSPF
     A* 修正#18: TOTAL行を列ヘッダー上に移動
     A*           TOTAMT_D 15Y0O(整数) / FK日本語化
     A*=========================================================
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CA03(03 'F3=End')
     A                                      CA06(06 'F6=Reg')
     A                                      CA12(12 'F12=Bk')
     A                                      PRINT
     A                                      ERRSFL
     A*
     A*---------------------------------------------------------
     A* DETAIL - 明細SFL(行22-23 SFLPAG=2)
     A*---------------------------------------------------------
     A          R DETAIL                    SFL
     A            LINENO         2S 0O 22  2COLOR(GRN)
     A            ITEMCD        12A  B 22  5DSPATR(UL)
     A  41                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A            ITEMNM        22A  O 22 18COLOR(BLU)
     A            ORDQTY         7S 0B 22 42DSPATR(UL)
     A                                      COLOR(GRN)
     A            UNITPRC       13S 0B 22 51DSPATR(UL)
     A                                      COLOR(GRN)
     A*
     A*---------------------------------------------------------
     A* DETAILCTL - SFL制御
     A*---------------------------------------------------------
     A          R DETAILCTL                 SFLCTL(DETAIL)
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0002)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND(*MORE)
     A            SFLRRN         4S 0H
     A                                  1  2'受注入力'
     A                                      DSPATR(HI)
     A                                  1 70DATE(*JOB)
     A                                      EDTCDE(Y)
     A                                  2 70TIME
     A                                  3  2'=============================='
     A                                  5  2'顧客コード:'
     A                                  7  2'受注日    :'
     A                                  8  2'希望納期  :'
     A                                  9  2'通貨      :'
     A                                 10  2'支払条件  :'
     A                                 11  2'倉庫ID    :'
     A            CUSTCD_D      20A  O  5 16COLOR(TRQ)
     A            CUSTNM_D      40A  O  6 16COLOR(TRQ)
     A            ORDDATE_D      8A  O  7 16COLOR(TRQ)
     A            REQDATE_D      8A  O  8 16COLOR(TRQ)
     A            CURRCD_D       3A  O  9 16COLOR(TRQ)
     A            PAYTERM_D     20A  O 10 16COLOR(TRQ)
     A            WHID_D         4S 0O 11 16COLOR(TRQ)
     A            WHNM_D        35A  O 12 16COLOR(TRQ)
     A                                 14  2'=============================='
     A                                 15  2'合計金額  :'
     A                                      COLOR(GRN)
     A            TOTAMT_D      15Y 0O 15 16EDTCDE(1)
     A                                      COLOR(TRQ)
     A                                      DSPATR(HI)
     A                                 15 33'円'
     A                                      COLOR(GRN)
     A                                 16  2'=============================='
     A                                 17  2'No'
     A                                 17  5'商品CD'
     A                                 17 18'商品名'
     A                                 17 42'数量'
     A                                 17 51'単価'
     A                                 18  2'=============================='
     A            ERRMSG_D      50A  O 19  2DSPATR(HI)
     A                                      COLOR(RED)
     A                                 20  2'F3=終了 F6=登録 F12=戻る'
     A                                      COLOR(TRQ)
     A*
     A*---------------------------------------------------------
     A* HEADER - ヘッダー入力
     A*---------------------------------------------------------
     A          R HEADER
     A                                  1  2'受注入力'
     A                                      DSPATR(HI)
     A                                  1 70DATE(*JOB)
     A                                      EDTCDE(Y)
     A                                  2 70TIME
     A                                  3  2'=============================='
     A                                  5  2'顧客コード:'
     A            CUSTCD        20A  B  5 16DSPATR(UL)
     A                                      DSPATR(MDT)
     A  31                              5 37'見つかりません'
     A                                      DSPATR(HI)
     A                                      COLOR(RED)
     A            CUSTNM        40A  O  6 16DSPATR(HI)
     A                                      COLOR(TRQ)
     A                                  7  2'受注日    :'
     A            ORDDATE        8A  B  7 16DSPATR(UL)
     A  32                              7 37'日付エラー'
     A                                      DSPATR(HI)
     A                                      COLOR(RED)
     A                                  8  2'希望納期  :'
     A            REQDATE        8A  B  8 16DSPATR(UL)
     A  33                              8 37'納期エラー'
     A                                      DSPATR(HI)
     A                                      COLOR(RED)
     A                                  9  2'通貨      :'
     A            CURRCD         3A  B  9 16DSPATR(UL)
     A  34                              9 37'通貨コードエラー'
     A                                      DSPATR(HI)
     A                                      COLOR(RED)
     A                                 10  2'支払条件  :'
     A            PAYTERM       20A  B 10 16DSPATR(UL)
     A                                 11  2'倉庫ID    :'
     A            WHID           4S 0B 11 16DSPATR(UL)
     A  35                             11 37'倉庫なし'
     A                                      DSPATR(HI)
     A                                      COLOR(RED)
     A            WHNM          35A  O 12 16DSPATR(HI)
     A                                      COLOR(TRQ)
     A                                 14  2'=============================='
     A                                 19  2'F3=終了 F12=取消 Enter=表示'
     A                                      COLOR(TRQ)
     A            ERRMSG        78A  O 24  2DSPATR(HI)
     A                                      COLOR(RED)
     A*
     A*---------------------------------------------------------
     A* CONFIRM - 確認画面(OVERLAY)
     A*---------------------------------------------------------
     A          R CONFIRM
     A                                      OVERLAY
     A                                  1  2'受注入力 - 確認'
     A                                      DSPATR(HI)
     A                                  1 70DATE(*JOB)
     A                                      EDTCDE(Y)
     A                                  2 70TIME
     A                                  3  2'=============================='
     A                                  5  2'顧客コード:'
     A                                  7  2'受注日    :'
     A                                  8  2'希望納期  :'
     A                                  9  2'通貨      :'
     A                                 10  2'支払条件  :'
     A                                 11  2'倉庫ID    :'
     A            CUSTCD_C      20A  O  5 16COLOR(TRQ)
     A            CUSTNM_C      40A  O  6 16COLOR(TRQ)
     A            ORDDATE_C      8A  O  7 16COLOR(TRQ)
     A            REQDATE_C      8A  O  8 16COLOR(TRQ)
     A            CURRCD_C       3A  O  9 16COLOR(TRQ)
     A            PAYTERM_C     20A  O 10 16COLOR(TRQ)
     A            WHID_C         4S 0O 11 16COLOR(TRQ)
     A            WHNM_C        35A  O 12 16COLOR(TRQ)
     A                                 14  2'=============================='
     A                                 15  2'この内容で登録しますか?'
     A                                      DSPATR(HI)
     A                                 16  2'合計金額  :'
     A                                      COLOR(GRN)
     A            TOTAMT        15Y 0O 16 16EDTCDE(1)
     A                                      COLOR(TRQ)
     A                                      DSPATR(HI)
     A                                 16 33'円'
     A                                      COLOR(GRN)
     A                                 23  2'Enter=登録 F12=明細へ戻る'
     A                                      COLOR(TRQ)
     A*
     A*---------------------------------------------------------
     A* COMPLETE - 完了画面(OVERLAY 行23-24)
     A*---------------------------------------------------------
     A          R COMPLETE
     A                                      OVERLAY
     A                                 23  2'受注登録が完了しました'
     A                                      DSPATR(HI)
     A                                      COLOR(GRN)
     A                                 24  2'受注番号  :'
     A            SONUM         20A  O 24 16DSPATR(HI)
     A                                 23 40'Enter=続けて入力 F3=終了'
     A                                      COLOR(TRQ)

