      *===============================================================
      * 物理ファイル: SORDERLP (受注明細)
      * ライブラリ: DEMOAPP
      * 説明: 受注の商品明細管理
      *===============================================================
     A                                      UNIQUE
     A          R SOLREC
     A                                      TEXT('受注明細レコード')
     A*
     A* キーフィールド（複合キー）
     A            SOID          18P 0       COLHDG('受注ID')
     A                                      TEXT('受注ID')
     A            LINENO         9P 0       COLHDG('明細' '行番号')
     A                                      TEXT('明細行番号')
     A*
     A* 商品情報
     A            ITEMID         9P 0       COLHDG('商品ID')
     A                                      TEXT('商品ID')
     A*
     A* 数量・単価
     A            ORDQTY        15P 3       COLHDG('受注数量')
     A                                      TEXT('受注数量')
     A            UNITPRC       15P 4       COLHDG('単価')
     A                                      TEXT('単価')
     A            TAXRATE        5P 3       COLHDG('税率')
     A                                      TEXT('税率')
     A            LINEAMT       15P 2       COLHDG('明細金額')
     A                                      TEXT('明細金額')
     A*
     A* 引当・出荷状況
     A            ALCQTY        15P 3       COLHDG('引当済' '数量')
     A                                      TEXT('引当済数量')
     A            SHPQTY        15P 3       COLHDG('出荷済' '数量')
     A                                      TEXT('出荷済数量')
     A            STATUS        12A         COLHDG('ステータス')
     A                                      TEXT('明細ステータス')
     A*
     A* キー定義
     A          K SOID
     A          K LINENO
