      *===============================================================
      * 物理ファイル: SORDERHP (受注ヘッダ)
      * ライブラリ: DEMOAPP
      * 説明: 受注の基本情報管理
      *===============================================================
     A                                      UNIQUE
     A          R SOHREC
     A                                      TEXT('受注ヘッダレコード')
     A*
     A* キーフィールド
     A            SOID          18P 0       COLHDG('受注ID')
     A                                      TEXT('受注ID')
     A*
     A* 業務キー
     A            SONUM         20A         COLHDG('受注番号')
     A                                      TEXT('受注番号(業務キー)')
     A*
     A* 顧客情報
     A            CUSTID         9P 0       COLHDG('顧客ID')
     A                                      TEXT('顧客ID')
     A*
     A* 受注情報
     A            ORDDATE        8P 0       COLHDG('受注日')
     A                                      TEXT('受注日')
     A            REQDATE        8P 0       COLHDG('希望納期')
     A                                      TEXT('希望納期')
     A            CURRCD         3A         COLHDG('通貨')
     A                                      TEXT('通貨コード')
     A            PAYTERM       20O         COLHDG('支払条件')
     A                                      TEXT('支払条件')
     A            WHID           4P 0       COLHDG('倉庫ID')
     A                                      TEXT('出荷元倉庫ID')
     A*
     A* ステータス・金額
     A            STATUS        12A         COLHDG('ステータス')
     A                                      TEXT('ステータス')
     A            TOTAMT        15P 2       COLHDG('合計金額')
     A                                      TEXT('合計金額')
     A*
     A* 監査情報
     A            CRTUSER       30O         COLHDG('作成者')
     A                                      TEXT('作成ユーザー')
     A            CRTDATE        8P 0       COLHDG('作成日')
     A                                      TEXT('作成日付')
     A            CRTTIM         6P 0       COLHDG('作成時刻')
     A                                      TEXT('作成時刻')
     A            UPDUSER       30O         COLHDG('更新者')
     A                                      TEXT('更新ユーザー')
     A            UPDDATE        8P 0       COLHDG('更新日')
     A                                      TEXT('更新日付')
     A            UPDTIM         6P 0       COLHDG('更新時刻')
     A                                      TEXT('更新時刻')
     A*
     A* キー定義
     A          K SOID
