      *===============================================================
      * 物理ファイル: WAREHOUSEP (倉庫マスタ)
      * ライブラリ: DEMOAPP
      * 説明: 物流拠点の管理
      *===============================================================
     A                                      UNIQUE
     A          R WHREC
     A                                      TEXT('倉庫マスタレコード')
     A*
     A* キーフィールド
     A            WHID           4P 0       COLHDG('倉庫ID')
     A                                      TEXT('倉庫ID')
     A*
     A* 業務キー
     A            WHCD          10A         COLHDG('倉庫' 'コード')
     A                                      TEXT('倉庫コード')
     A*
     A* 基本情報
     A            WHNM          60O         COLHDG('倉庫名')
     A                                      TEXT('倉庫名称')
     A            WHADR         60O         COLHDG('所在地')
     A                                      TEXT('倉庫所在地')
     A            MGRNM         60O         COLHDG('責任者名')
     A                                      TEXT('倉庫責任者名')
     A            STATUS        10A         COLHDG('ステータス')
     A                                      TEXT('ステータス')
     A*
     A* 監査情報
     A            CRTUSER       30O         COLHDG('作成者')
     A                                      TEXT('作成ユーザー')
     A            CRTDATE        8P 0       COLHDG('作成日')
     A                                      TEXT('作成日付')
     A            CRTTIM         6P 0       COLHDG('作成時刻')
     A                                      TEXT('作成時刻')
     A            UPDUSER       30O         COLHDG('更新者')
     A                                      TEXT('更新ユーザー')
     A            UPDDATE        8P 0       COLHDG('更新日')
     A                                      TEXT('更新日付')
     A            UPDTIM         6P 0       COLHDG('更新時刻')
     A                                      TEXT('更新時刻')
     A*
     A* キー定義
     A          K WHID
