      *===============================================================
      * 物理ファイル: APPUSERP (アプリケーションユーザー)
      * ライブラリ: DEMOAPP
      * 説明: システム利用者の管理
      *===============================================================
     A                                      UNIQUE
     A          R USERREC
     A                                      TEXT('ユーザーレコード')
     A*
     A* キーフィールド
     A            USERID         9P 0       COLHDG('ユーザー' 'ID')
     A                                      TEXT('ユーザーID')
     A*
     A* 業務キー
     A            USERNAME      30O         COLHDG('ユーザー名')
     A                                      TEXT('ユーザー名')
     A*
     A* 基本情報
     A            FULLNAME      60O         COLHDG('氏名')
     A                                      TEXT('氏名')
     A            EMAIL         60O         COLHDG('メール')
     A                                      TEXT('メールアドレス')
     A            DEPT          30O         COLHDG('部門')
     A                                      TEXT('部門')
     A*
     A* ステータス
     A            STATUS        10A         COLHDG('ステータス')
     A                                      TEXT('ステータス')
     A*
     A* 監査情報
     A            CRTDATE        8P 0       COLHDG('作成日')
     A                                      TEXT('作成日付')
     A            CRTTIM         6P 0       COLHDG('作成時刻')
     A                                      TEXT('作成時刻')
     A            UPDDATE        8P 0       COLHDG('更新日')
     A                                      TEXT('更新日付')
     A            UPDTIM         6P 0       COLHDG('更新時刻')
     A                                      TEXT('更新時刻')
     A*
     A* キー定義
     A          K USERID
