      *===============================================================
      * 物理ファイル: CUSTOMERP (顧客台帳)
      * ライブラリ: DEMOAPP
      * 説明: 取引先企業・個人の基本情報を管理
      *===============================================================
     A                                      UNIQUE
     A          R CUSTREC
     A                                      TEXT('顧客台帳レコード')
     A*
     A* キーフィールド
     A            CUSTID         9P 0       COLHDG('顧客ID')
     A                                      TEXT('顧客ID')
     A*
     A* 業務キー
     A            CUSTCD        20A         COLHDG('顧客' 'コード')
     A                                      TEXT('顧客コード')
     A*
     A* 基本情報
     A            CUSTNM        60O         COLHDG('顧客名')
     A                                      TEXT('顧客名称')
     A            BILLADR       60O         COLHDG('請求先' '住所')
     A                                      TEXT('請求先住所')
     A            SHIPADR       60O         COLHDG('配送先' '住所')
     A                                      TEXT('配送先住所')
     A            TAXCAT        10A         COLHDG('税区分')
     A                                      TEXT('税区分コード')
     A            CURRCD         3A         COLHDG('通貨')
     A                                      TEXT('基準通貨コード')
     A            CREDLMT       15P 2       COLHDG('与信' '限度額')
     A                                      TEXT('与信限度額')
     A            STATUS        10A         COLHDG('ステータス')
     A                                      TEXT('ステータス')
     A*
     A* 監査情報
     A            CRTUSER       30O         COLHDG('作成者')
     A                                      TEXT('作成ユーザー')
     A            CRTDATE        8P 0       COLHDG('作成日')
     A                                      TEXT('作成日付')
     A            CRTTIM         6P 0       COLHDG('作成時刻')
     A                                      TEXT('作成時刻')
     A            UPDUSER       30O         COLHDG('更新者')
     A                                      TEXT('更新ユーザー')
     A            UPDDATE        8P 0       COLHDG('更新日')
     A                                      TEXT('更新日付')
     A            UPDTIM         6P 0       COLHDG('更新時刻')
     A                                      TEXT('更新時刻')
     A*
     A* キー定義
     A          K CUSTID
