      *===============================================================
      * 物理ファイル: ITEMP (商品台帳)
      * ライブラリ: DEMOAPP
      * 説明: 販売商品のマスタ情報管理
      *===============================================================
     A                                      UNIQUE
     A          R ITEMREC
     A                                      TEXT('商品台帳レコード')
     A*
     A* キーフィールド
     A            ITEMID         9P 0       COLHDG('商品ID')
     A                                      TEXT('商品ID')
     A*
     A* 業務キー
     A            ITEMCD        12A         COLHDG('商品' 'コード')
     A                                      TEXT('商品コード')
     A*
     A* 基本情報
     A            ITEMDSC       40O         COLHDG('商品説明')
     A                                      TEXT('商品説明')
     A            UOM           10A         COLHDG('単位')
     A                                      TEXT('単位(EA/KG/L等)')
     A            UNITPRC       15P 4       COLHDG('標準単価')
     A                                      TEXT('標準単価')
     A            CATEGORY      30A         COLHDG('カテゴリ')
     A                                      TEXT('商品カテゴリ')
     A            STATUS        10A         COLHDG('ステータス')
     A                                      TEXT('ステータス')
     A*
     A* 監査情報
     A            CRTUSER       30O         COLHDG('作成者')
     A                                      TEXT('作成ユーザー')
     A            CRTDATE        8P 0       COLHDG('作成日')
     A                                      TEXT('作成日付')
     A            CRTTIM         6P 0       COLHDG('作成時刻')
     A                                      TEXT('作成時刻')
     A            UPDUSER       30O         COLHDG('更新者')
     A                                      TEXT('更新ユーザー')
     A            UPDDATE        8P 0       COLHDG('更新日')
     A                                      TEXT('更新日付')
     A            UPDTIM         6P 0       COLHDG('更新時刻')
     A                                      TEXT('更新時刻')
     A*
     A* キー定義
     A          K ITEMID
