      *===============================================================
      * 論理ファイル: SORDERLL1 (受注明細 - 商品ID順)
      * ライブラリ: DEMOAPP
      * 説明: 商品別の受注検索用論理ファイル
      *===============================================================
     A          R SOLREC                    PFILE(SORDERLP)
     A          K ITEMID
     A          K SOID
     A          K LINENO
