             PGM
/*=====================================================================*/
/* プログラム名: INITDATA                                               */
/* 説明: 初期マスタデータの投入                                          */
/* ライブラリ: HANBAI                                                  */
/* 作成日: 2025-01-18                                                   */
/*=====================================================================*/

             DCL        VAR(&MSGID) TYPE(*CHAR) LEN(7)
             DCL        VAR(&MSGDTA) TYPE(*CHAR) LEN(512)

             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ERROR))

/*---------------------------------------------------------------------*/
/* 開始メッセージ                                                       */
/*---------------------------------------------------------------------*/
             SNDPGMMSG  MSG('初期データ投入を開始します') TOPGMQ(*EXT) MSGTYPE(*INFO)

/*---------------------------------------------------------------------*/
/* 1. コードマスタの投入                                                */
/*---------------------------------------------------------------------*/
             SNDPGMMSG  MSG('コードマスタを投入中...') TOPGMQ(*EXT) MSGTYPE(*INFO)

             CALL       PGM(HANBAI/INITCODE)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ERROR))

/*---------------------------------------------------------------------*/
/* 2. 倉庫マスタの投入                                                  */
/*---------------------------------------------------------------------*/
             SNDPGMMSG  MSG('倉庫マスタを投入中...') TOPGMQ(*EXT) MSGTYPE(*INFO)

             CALL       PGM(HANBAI/INITWH)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ERROR))

/*---------------------------------------------------------------------*/
/* 3. 顧客マスタの投入                                                  */
/*---------------------------------------------------------------------*/
             SNDPGMMSG  MSG('顧客マスタを投入中...') TOPGMQ(*EXT) MSGTYPE(*INFO)

             CALL       PGM(HANBAI/INITCUST)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ERROR))

/*---------------------------------------------------------------------*/
/* 4. 商品マスタの投入                                                  */
/*---------------------------------------------------------------------*/
             SNDPGMMSG  MSG('商品マスタを投入中...') TOPGMQ(*EXT) MSGTYPE(*INFO)

             CALL       PGM(HANBAI/INITITEM)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ERROR))

/*---------------------------------------------------------------------*/
/* 5. 為替レートの投入                                                  */
/*---------------------------------------------------------------------*/
             SNDPGMMSG  MSG('為替レートを投入中...') TOPGMQ(*EXT) MSGTYPE(*INFO)

             CALL       PGM(HANBAI/INITFX)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ERROR))

/*---------------------------------------------------------------------*/
/* 6. 在庫データの投入                                                  */
/*---------------------------------------------------------------------*/
             SNDPGMMSG  MSG('在庫データを投入中...') TOPGMQ(*EXT) MSGTYPE(*INFO)

             CALL       PGM(HANBAI/INITINV)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ERROR))

/*---------------------------------------------------------------------*/
/* 7. アプリケーションユーザーの投入                                     */
/*---------------------------------------------------------------------*/
             SNDPGMMSG  MSG('アプリケーションユーザーを投入中...') TOPGMQ(*EXT) MSGTYPE(*INFO)

             CALL       PGM(HANBAI/INITUSER)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ERROR))

/*---------------------------------------------------------------------*/
/* 完了メッセージ                                                       */
/*---------------------------------------------------------------------*/
             SNDPGMMSG  MSG('初期データ投入が正常に完了しました') TOPGMQ(*EXT) MSGTYPE(*COMP)

             GOTO       CMDLBL(ENDPGM)

/*---------------------------------------------------------------------*/
/* エラー処理                                                           */
/*---------------------------------------------------------------------*/
 ERROR:      RCVMSG     MSGTYPE(*EXCP) MSGDTA(&MSGDTA) MSGID(&MSGID)

             SNDPGMMSG  MSG('初期データ投入でエラーが発生しました') TOPGMQ(*EXT) MSGTYPE(*DIAG)

/*---------------------------------------------------------------------*/
/* プログラム終了                                                       */
/*---------------------------------------------------------------------*/
 ENDPGM:     ENDPGM

