      /*==============================================================*/
      /* CLプログラム: SETUPJRN                                       */
      /* ライブラリ: HANBAI                                          */
      /* 説明: ジャーナル環境のセットアップ                           */
      /*==============================================================*/
             PGM

             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10) VALUE('HANBAI')
             DCL        VAR(&MSGID) TYPE(*CHAR) LEN(7)
             DCL        VAR(&MSGDTA) TYPE(*CHAR) LEN(512)

             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ERROR))

      /*--------------------------------------------------------------*/
      /* ジャーナルレシーバーの作成                                   */
      /*--------------------------------------------------------------*/
             SNDPGMMSG  MSG('ジャーナルレシーバーを作成中...') TOPGMQ(*EXT)

             CRTJRNRCV  JRNRCV(&LIB/JRNRCV0001) TEXT('O2C Journal Receiver 0001') THRESHOLD(500000)
             MONMSG     MSGID(CPF7010) /* 既に存在 */

      /*--------------------------------------------------------------*/
      /* ジャーナルの作成                                             */
      /*--------------------------------------------------------------*/
             SNDPGMMSG  MSG('ジャーナルを作成中...') TOPGMQ(*EXT)

             CRTJRN     JRN(&LIB/O2CJRN) JRNRCV(&LIB/JRNRCV0001) MNGRCV(*SYSTEM) DLTRCV(*YES) +
                          TEXT('O2C Journal') RCVSIZOPT(*RMVINTENT)
             MONMSG     MSGID(CPF7010)

      /*--------------------------------------------------------------*/
      /* 物理ファイルのジャーナル開始                                 */
      /*--------------------------------------------------------------*/
             SNDPGMMSG  MSG('ファイルのジャーナリングを開始中...') TOPGMQ(*EXT)

      /* マスタファイル */
             STRJRNPF   FILE(&LIB/CUSTOMERP) JRN(&LIB/O2CJRN) IMAGES(*BOTH) OMTJRNE(*OPNCLO)
             MONMSG     MSGID(CPF7030) /* 既にジャーナル中 */

             STRJRNPF   FILE(&LIB/ITEMP) JRN(&LIB/O2CJRN) IMAGES(*BOTH) OMTJRNE(*OPNCLO)
             MONMSG     MSGID(CPF7030)

             STRJRNPF   FILE(&LIB/WAREHOUSEP) JRN(&LIB/O2CJRN) IMAGES(*BOTH) OMTJRNE(*OPNCLO)
             MONMSG     MSGID(CPF7030)

             STRJRNPF   FILE(&LIB/INVENTORYP) JRN(&LIB/O2CJRN) IMAGES(*BOTH) OMTJRNE(*OPNCLO)
             MONMSG     MSGID(CPF7030)

      /* トランザクションファイル */
             STRJRNPF   FILE(&LIB/SORDERHP) JRN(&LIB/O2CJRN) IMAGES(*BOTH) OMTJRNE(*OPNCLO)
             MONMSG     MSGID(CPF7030)

             STRJRNPF   FILE(&LIB/SORDERLP) JRN(&LIB/O2CJRN) IMAGES(*BOTH) OMTJRNE(*OPNCLO)
             MONMSG     MSGID(CPF7030)

             STRJRNPF   FILE(&LIB/SHIPMENTHP) JRN(&LIB/O2CJRN) IMAGES(*BOTH) OMTJRNE(*OPNCLO)
             MONMSG     MSGID(CPF7030)

             STRJRNPF   FILE(&LIB/SHIPMENTLP) JRN(&LIB/O2CJRN) IMAGES(*BOTH) OMTJRNE(*OPNCLO)
             MONMSG     MSGID(CPF7030)

             STRJRNPF   FILE(&LIB/INVOICEHP) JRN(&LIB/O2CJRN) IMAGES(*BOTH) OMTJRNE(*OPNCLO)
             MONMSG     MSGID(CPF7030)

             STRJRNPF   FILE(&LIB/INVOICELP) JRN(&LIB/O2CJRN) IMAGES(*BOTH) OMTJRNE(*OPNCLO)
             MONMSG     MSGID(CPF7030)

             STRJRNPF   FILE(&LIB/PAYMENTP) JRN(&LIB/O2CJRN) IMAGES(*BOTH) OMTJRNE(*OPNCLO)
             MONMSG     MSGID(CPF7030)

      /* 補助ファイル */
             STRJRNPF   FILE(&LIB/FXRATEP) JRN(&LIB/O2CJRN) IMAGES(*BOTH) OMTJRNE(*OPNCLO)
             MONMSG     MSGID(CPF7030)

             STRJRNPF   FILE(&LIB/CODEMSTRP) JRN(&LIB/O2CJRN) IMAGES(*BOTH) OMTJRNE(*OPNCLO)
             MONMSG     MSGID(CPF7030)

             STRJRNPF   FILE(&LIB/APPUSERP) JRN(&LIB/O2CJRN) IMAGES(*BOTH) OMTJRNE(*OPNCLO)
             MONMSG     MSGID(CPF7030)

             STRJRNPF   FILE(&LIB/USERROLEP) JRN(&LIB/O2CJRN) IMAGES(*BOTH) OMTJRNE(*OPNCLO)
             MONMSG     MSGID(CPF7030)

             STRJRNPF   FILE(&LIB/CHANGELOGP) JRN(&LIB/O2CJRN) IMAGES(*BOTH) OMTJRNE(*OPNCLO)
             MONMSG     MSGID(CPF7030)

      /*--------------------------------------------------------------*/
      /* コミット制御の開始                                           */
      /*--------------------------------------------------------------*/
             SNDPGMMSG  MSG('コミット制御を開始中...') TOPGMQ(*EXT)

             STRCMTCTL  LCKLVL(*CHG) CMTSCOPE(*ACTGRP)
             MONMSG     MSGID(CPF8355) /* 既に開始済み */

      /*--------------------------------------------------------------*/
      /* 完了メッセージ                                               */
      /*--------------------------------------------------------------*/
             SNDPGMMSG  MSG('ジャーナル環境のセットアップが完了しました') TOPGMQ(*EXT) +
                          MSGTYPE(*COMP)

             GOTO       CMDLBL(ENDPGM)

      /*--------------------------------------------------------------*/
      /* エラー処理                                                   */
      /*--------------------------------------------------------------*/
 ERROR:
             RCVMSG     MSGTYPE(*EXCP) MSGDTA(&MSGDTA) MSGID(&MSGID)
             SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA('エラー: ' *BCAT &MSGID *BCAT ' - ' +
                          *BCAT &MSGDTA) MSGTYPE(*ESCAPE)

 ENDPGM:
             ENDPGM
